Revit 2024 API
Profile.Clone Method
Returns a copy of this profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Profile Clone()
Visual Basic
Public Function Clone As Profile
Visual C++
public:
Profile^ Clone()
See Also
Profile Class
Autodesk.Revit.DB Namespace